_notes/_posts/language/2024-07-31-swift.org
#+LAYOUT: post
#+TITLE: 单词本：swift
#+TAGS: English
#+CATEGORIES: language

今天公司内网社交网站上有个老板写了个消息夸奖某个团队说他们的快速响应得
到了对方企业执行管理层的嘉奖：

*Swift* global service response secures executive praise

这个 swift 有不少意思，比如
- 名词：雨燕
- 形容词：迅速的、立刻的
- 形容词：速度飞快的、水流湍急的
- 苹果系统编程语言
- Society for Worldwide Interbank Financial Telecommunications 环球同
  业银行金融电讯协会所管理的国际资金清算系统的简称 SWIFT

当然，在这句话里 *Swift* global service response secures executive
praise. swift 的意思是迅速之意。

最近，东方大国在推动 BRICS 金砖国家的银行结算系统。有望打破 SWIFT 的垄
断。其实也不是想挑战 SWIFT，只是 SWIFT 动不动就要踢人，东方大国不得不
留条后路，免得仓促切换引起混乱罢了。
