_posts/language/2024-07-31-swift.html
---
layout: post
title: 单词本：swift
tags: [English]
categories: [language]
---
<p>
今天公司内网社交网站上有个老板写了个消息夸奖某个团队说他们的快速响应得到了对方企业执行管理层的嘉奖：
</p>

<p>
<b>Swift</b> global service response secures executive praise
</p>

<p>
这个 swift 有不少意思，比如
</p>
<ul class="org-ul">
<li>名词：雨燕</li>
<li>形容词：迅速的、立刻的</li>
<li>形容词：速度飞快的、水流湍急的</li>
<li>苹果系统编程语言</li>
<li>Society for Worldwide Interbank Financial Telecommunications 环球同业银行金融电讯协会所管理的国际资金清算系统的简称 SWIFT</li>
</ul>

<p>
当然，在这句话里 <b>Swift</b> global service response secures executive
praise. swift 的意思是迅速之意。
</p>

<p>
最近，东方大国在推动 BRICS 金砖国家的银行结算系统。有望打破 SWIFT 的垄断。其实也不是想挑战 SWIFT ，只是 SWIFT动不动就要踢人，东方大国不得不留条后路，免得仓促切换引起混乱罢了。
</p>
